app/controllers/messages_controller.rb

SELECT MAX(`message_logs`.`id`) AS max_id FROM `message_logs`
SELECT `message_logs`.* FROM `message_logs` ORDER BY id DESC LIMIT 18446744073709551615 OFFSET 10
---
  def show
  	@messages = MessageLog.order("id DESC").limit("10")

SELECT COUNT(*) FROM `message_logs`
INSERT INTO `message_logs` (`created_at`, `id`, `name`, `text`, `time`, `updated_at`) VALUES ('2014-12-01 10:05:35', 1, '田中', 'こんにちは、佐藤さん。今日はいい天気ですね。', '2014-12-01 19:05:35 +0900', '2014-12-01 10:05:35')
---
  def post
#   インスタンス変数に代入
    @current_time = Time.now.to_s
  	@sent_message = params[:sent_message]
#   IDを設定する
#    if MessageLog.nil?
#      messages_id = 1
#    else
#      messages_id = MessageLog.maximum("id") + 1
#    end
     messages_id = MessageLog.count + 1
#   データベースに記録する
    message_log = MessageLog.new(params[:sent_message])
    message_log.time = @current_time
    message_log.id = messages_id

    message_log.save

SELECT `message_logs`.* FROM `message_logs` WHERE `message_logs`.`id` = 19 LIMIT 1
DELETE FROM `message_logs` WHERE `message_logs`.`id` = 19
---
  def destroy
  	message_log = MessageLog.find(params[:id])
  	message_log.destroy